<a href="https://colab.research.google.com/github/ChuquEmeka/Data-Analysis-using-mysql-python-connection-string/blob/main/Data_Analysis_with_mysql_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### Data Analysis using mysql-python connection string


##### By EDEH EMEKA N.

Question 1 :
How much money was paid in cash in the month of November 2016? 
  
Question 2 :
How much money is owed by customer Bill Wiggin? Show this for the different services offered. 
  
Question 3 :
How much money has Caroline Nokes paid so far? include her corresponding details (such as payment method, what was paid for, and whether it was paid in advance, during the stay, or at check-out time).

In [ ]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.27-1commercial-cp38-cp38-win_amd64.whl (7.7 MB)
Collecting protobuf>=3.0.0
  Downloading protobuf-3.19.1-cp38-cp38-win_amd64.whl (895 kB)
Installing collected packages: protobuf, mysql-connector-python
Successfully installed mysql-connector-python-8.0.27 protobuf-3.19.1

In [ ]:
import mysql.connector

In [ ]:
!pip install pandas

In [ ]:
import pandas as pd

In [ ]:
#python-mysql database connection
guest = mysql.connector.connect(host='localhost', user='root', passwd='xxxx' , database='guesthouse')
guest

In [ ]:
#Test for successful connection
if(guest):
    print("connection successfull")
else:
    print('connection unsuccesful')

connection successfull

In [ ]:
cursor = guest.cursor()

In [ ]:
#view tables in guesthouse database. These tables are related and required for this analysis.
tables = pd.read_sql("Show tables;", con=guest)
tables

   Tables_in_guesthouse
0               booking
1              calendar
2                 extra
3                 guest
4               payment
5        payment_method
6          payment_mode
7                  rate
8                  room
9             room_type
10         service_type

##### View contents of the tables

In [ ]:
booking = pd.read_sql("select * from booking;", con=guest)
booking

,booking_id,booking_date,room_no,guest_id,occupants,room_type_requested,nights,arrival_time
0,5001,2016-11-03,101,1027,1,single,7,13:00
1,5002,2016-11-03,102,1179,1,double,2,18:00
2,5003,2016-11-03,103,1106,2,double,2,21:00
3,5004,2016-11-03,104,1238,1,double,3,22:00
4,5005,2016-11-03,105,1540,3,family,7,17:00
...,...,...,...,...,...,...,...,...
342,5357,2016-12-10,307,1054,1,double,3,13:00
343,5358,2016-12-07,308,1072,1,double,3,23:00
344,5359,2016-11-24,309,1597,2,double,4,15:00
345,5360,2016-12-08,310,1343,2,double,3,22:00
346,5361,2016-12-12,301,1001,1,single,1,12:00

In [ ]:
calendar = pd.read_sql("select * from calendar;", con=guest)
calendar

               i
0     2016-11-03
1     2016-11-04
2     2016-11-05
3     2016-11-06
4     2016-11-07
...          ...
1019  2019-08-19
1020  2019-08-20
1021  2019-08-21
1022  2019-08-22
1023  2019-08-23

[1024 rows x 1 columns]

In [ ]:
extra = pd.read_sql("select * from extra;", con=guest)
extra

     extra_id  booking_id        description  amount
0      500101        5001      Breakfast x 7   63.00
1      500201        5002      Breakfast x 2   18.00
2      500301        5003      Breakfast x 4   36.00
3      500302        5003  Phone Calls £4.69    4.69
4      500402        5004  Phone Calls £3.52    3.52
..        ...         ...                ...     ...
202    535402        5354  Phone Calls £0.89    0.89
203    535602        5356  Phone Calls £4.77    4.77
204    535701        5357      Breakfast x 8   72.00
205    535901        5359      Breakfast x 5   45.00
206    535902        5359  Phone Calls £4.06    4.06

[207 rows x 4 columns]

In [ ]:
guest = pd.read_sql("select * from guest;", con=guest)
guest

       id       first_name  last_name                            address
0    1001              Jim       Dowd            Lewisham West and Penge
1    1002              Lyn      Brown                           West Ham
2    1003              Ann      Clwyd                       Cynon Valley
3    1004              Nic      Dakin                         Scunthorpe
4    1005              Pat      Glass                  North West Durham
..    ...              ...        ...                                ...
644  1645     Stuart Blair  Donaldson  West Aberdeenshire and Kincardine
645  1646  Stewart Malcolm   McDonald                      Glasgow South
646  1647   Sir Jeffrey M.  Donaldson                       Lagan Valley
647  1648      Ms Margaret    Ritchie                         South Down
648  1649      Dr Alasdair  McDonnell                      Belfast South

[649 rows x 4 columns]

In [ ]:
payment = pd.read_sql("select * from payment;", con=guest)
payment

,id,payment_date,amount_paid,payment_method_id,service_id,booking_id,extra_id
0,1,2016-11-01,72.00,1,1,5003,NaN
1,2,2016-11-04,36.00,2,2,5003,500301.0
2,3,2016-12-03,45.00,3,2,5339,533901.0
3,4,2016-12-06,72.00,4,1,5340,NaN
4,5,2016-12-08,360.00,5,1,5342,NaN
5,6,2016-12-11,1.28,6,2,5342,534202.0
6,7,2016-11-28,144.00,7,1,5348,NaN
7,8,2016-12-01,1.87,8,2,5350,535002.0
8,9,2016-12-01,8.00,8,2,5350,535001.0
9,10,2016-11-28,72.00,9,1,5350,NaN
10,11,2016-11-29,56.00,10,1,5355,NaN

In [ ]:
payment_method = pd.read_sql("select * from payment_method;", con=guest)
payment_method

   id          card_number bank_account_number  guest_id  payment_mode_id
0   1  4400 0000 0000 0002                None      1106                3
1   2                 None                None      1106                1
2   3  3400 0000 0000 0065                None      1185                2
3   4  1100 0000 0000 0023                None      1227                3
4   5                 None   01-00-00 85002213      1252                4
5   6  4200 0000 0000 0063                None      1252                2
6   7                 None                None      1366                1
7   8                 None                None      1413                1
8   9                 None   09-00-09 99002089      1413                4
9  10                 None                None      1419                1

In [ ]:
payment_mode = pd.read_sql("select * from payment_mode;", con=guest)
payment_mode

   id                  description
0   4  BACS (direct bank transfer)
1   1                         Cash
2   2                  Credit card
3   3                   Debit card

In [ ]:
rate = pd.read_sql("select * from rate;", con=guest)
rate

  room_type  occupancy  amount
0    double          1    56.0
1    double          2    72.0
2    family          1    56.0
3    family          2    72.0
4    family          3    84.0
5    single          1    48.0
6      twin          1    50.0
7      twin          2    72.0

In [ ]:
room = pd.read_sql("select * from room;", con=guest)
room.head()

    id room_type  max_occupancy
0  101    single              1
1  102    double              2
2  103    double              2
3  104    double              2
4  105    family              3

In [ ]:
room_type= pd.read_sql("select * from room_type;", con=guest)
room_type

       id                                   description
0  double             Fabulously appointed double room.
1  family       Superior appartment for up to 3 people.
2  single  Luxury accomodation suitable for one person.
3    twin                    Superb room with two beds.

In [ ]:
service_type = pd.read_sql("select * from service_type;", con=guest)
service_type

   id  service_name
0   1  accomodation
1   2        extras

##### Question 1 How much money was paid in cash in the month of November 2016
In this case, the cash payment mode id is the number 1 as shown in payment_mode(as primary key) and payment_method(as foreign key) tables. I will be needing attributes from payment table and payment_method table.

In [ ]:
total_paid_in_nov = pd.read_sql("select sum(amount_paid) as sum, payment_mode_id from payment p join payment_method pm where p.payment_method_id=pm.id and p.payment_date like '2016-11%' and payment_mode_id=1;", con=guest)
total_paid_in_nov

     sum  payment_mode_id
0  236.0                1

##### Question 2 How much money is owed by customer Bill Wiggin? Show this for the different services offered.

In [ ]:
#First, i will check the kind of services offered by the guesthouse.

service_type = pd.read_sql("select * from service_type;", con=guest)
service_type

   id  service_name
0   1  accomodation
1   2        extras

In [ ]:
# secondly, i will extract the guest id attached to the name 'Bill Wiggin'. This name only appeared in the guest table.
guest = pd.read_sql("select * from guest where first_name = 'Bill' and last_name='Wiggin';", con=guest)
guest

     id first_name last_name              address
0  1252       Bill    Wiggin  North Herefordshire

In [ ]:
#Then, i will use the guest_id to obtain booking details of Mr Bill Wiggin from the booking table 
guest_bill_wiggin = pd.read_sql("select * from booking where guest_id=1252;",con=guest )
guest_bill_wiggin

,booking_id,booking_date,room_no,guest_id,occupants,room_type_requested,nights,arrival_time
0,5342,2016-12-10,202,1252,2,double,5,13:00

From the query above, Mr Bill Wiggin spent 5 nights with another guest in a double room type. 
The query below will give us the room rates for the different room types and this will further help me in determinig the amount spent by Mr bill on accommodation alone.

In [ ]:
rate = pd.read_sql("select * from rate;", con=guest)
rate

  room_type  occupancy  amount
0    double          1    56.0
1    double          2    72.0
2    family          1    56.0
3    family          2    72.0
4    family          3    84.0
5    single          1    48.0
6      twin          1    50.0
7      twin          2    72.0

In [ ]:
#This is for the other service enjoyed by Mr Bill Wiggin. I got this using his unique booking_id
extras = pd.read_sql("select * from extra where booking_id=5342;",con=guest )
extras

   extra_id  booking_id        description  amount
0    534202        5342  Phone Calls £1.28    1.28

In [ ]:
Main_Query=pd.read_sql("select concat(first_name, ' ', last_name) as Name, b.guest_id, b.occupants, b.room_type_requested, b.nights, r.amount as accommodation_per_night_for_two, (nights * r.amount) as Accommodation_bill_for_5_nights, extra.amount as Extras_bill, ((nights*r.amount)+extra.amount) as Bill_Wiggin_Total_bill from booking b, guest g, rate r, extra where g.id= b.guest_id and b.room_type_requested= r.room_type and b.booking_id=extra.booking_id and b.booking_id = 5342 and r.occupancy=2", con=guest)
Main_Query

,Name,guest_id,occupants,room_type_requested,nights,accommodation_per_night_for_two,Accommodation_bill_for_5_nights,Extras_bill,Bill_Wiggin_Total_bill
0,Bill Wiggin,1252,2,double,5,72.0,360.0,1.28,361.28

##### Question 3 How much money has Caroline Nokes paid so far? include her corresponding details (such as payment method, what was paid for, and whether it was paid in advance, during the stay, or at check-out time).

In [ ]:
Carol_details = pd.read_sql("select * from guest where first_name='Caroline' and last_name= 'Nokes';",con=guest )
Carol_details

     id first_name last_name                       address
0  1413   Caroline     Nokes  Romsey and Southampton North

In [ ]:
#To retrieve her booking_id which will be used for further queries that can help retrieve her needed information, i will 
#use her guest_id to filter the query below to obtain her booking_id.
Carol_booking = pd.read_sql("select * from booking where guest_id=1413;",con=guest )
Carol_booking

,booking_id,booking_date,room_no,guest_id,occupants,room_type_requested,nights,arrival_time
0,5350,2016-12-01,210,1413,2,double,1,14:00

##### Amount paid by Caroline

In [ ]:
#Total amount paid by Caroline Nokes. The inner select sub-query fetches her name from the guest table.
payment_by_Carol = pd.read_sql("select(select concat(first_name, ' ', last_name) from guest where first_name ='Caroline' and last_name='Nokes') as Name ,sum(amount_paid) as Amount_Paid from payment where booking_id = 5350;",con=guest )
payment_by_Carol

             Name  Amount_Paid
0  Caroline Nokes        81.87

##### Caroline other corresponding details

In [ ]:
payment = pd.read_sql("select payment_date, service_id, case when payment_date = '2016-12-01' then 'paid during stay' when payment_date = '2016-11-28' then 'paid in advance' else 'paid_on_depature' end as time_of_payment, case when service_id=2 then 'extras' when service_id=1 then 'accommodation' end as service_type from payment where booking_id = 5350;",con=guest )
payment

  payment_date  service_id   time_of_payment   service_type
0   2016-12-01           2  paid during stay         extras
1   2016-12-01           2  paid during stay         extras
2   2016-11-28           1   paid in advance  accommodation